/* lr02_v19.c */

#include <stdio.h>
#include <conio.h>

main()
{
	float t1, t2, s1, s2;					// оголошуємо змінні
	printf("Calculation of way\n");		    // виводимо на екран 'Calculation of way', переміщуємо курсор на наступний рядок
	printf("Input time:\n");				// виводимо на екран 'Input time:', переміщуємо курсор на наступний рядок
	printf("time1=");						// виводимо на екран 'time1='
	scanf_s("%f", &t1);						// просимо користувача ввести перший період часу (можливий десятковий дріб)
	printf("time2=");						// виводимо на екран 'time2='
	scanf_s("%f", &t2);						// просимо користувача ввести другий період часу (можливий десятковий дріб)
	printf("Input speed:\n");				// виводимо на екран 'Input speed:', переміщуємо курсор на наступний рядок
	printf("speed1=");						// виводимо на екран 'speed1='
	scanf_s("%f", &s1);						// просимо користувача ввести швидкість за перший період (можливий десятковий дріб)
	printf("speed2=");						// виводимо на екран 'speed2='
	scanf_s("%f", &s2);						// просимо користувача ввести швидкість за другий період (можливий десятковий дріб)
	printf("way:\n");						// виводимо на екран 'way:', переміщуємо курсор на наступний рядок
	printf("l=%5.2f", s1 * t1 + s2 * t2);   /* виводимо на екран 'l=' та результат, вказуємо розмір найменшого поля(5), яке 
											   виділяється для друку, та кількість десяткових знаків після коми (2),
											   розраховуємо шлях: сума добутків t1 * s1 та t2 * s2
											*/	
	_getch();						        /* призупиняємо програму, чекаємо, поки користувач натисне
											   на будь-яку клавішу, і продовжуємо виконання програмного коду
											*/
	return 0;								// завершуємо програму з успішним виконанням
}











/* lr02_v07.c */


//#include <stdio.h>
//#include <conio.h>
//
//main()
//{
//	float op1, op2;					// оголошуємо змінні
//	printf("Calculator\n");			// виводимо на екран 'Calculator', переміщуємо курсор на наступний рядок
//	printf("Enter operand1:");		// виводимо на екран 'Enter operand1:'
//	scanf_s("%f", &op1);			// просимо користувача ввести перший операнд (можливий десятковий дріб)
//	printf("Enter operand1:");		// виводимо на екран 'Enter operand2:'
//	scanf_s("%f", &op2);			// просимо користувача ввести другий операнд (можливий десятковий дріб)
//	printf("product=");				// виводимо 'product='
//	printf("%5.2f\n", op1 * op2);   /* виводимо на екран добуток двох операндів, вказуємо
//									   розмір найменшого поля(5), яке виділяється для друку,
//									   та кількість десяткових знаків після коми (2), 
//									   переміщуємо курсор на наступний рядок
//									*/
//	printf("sum=");					// виводимо 'sum='
//	printf("%5.2f\n", op1 + op2);   /* виводимо на екран суму двох операндів, вказуємо
//									   розмір найменшого поля(5), яке виділяється для друку,
//									   та кількість десяткових знаків після коми (2), 
//									   переміщуємо курсор на наступний рядок
//								    */
//	printf("difference=");			// виводимо 'difference='
//	printf("%5.2f\n", op1 - op2);   /* виводимо на екран різницю двох операндів, вказуємо
//									   розмір найменшого поля(5), яке виділяється для друку,
//									   та кількість десяткових знаків після коми (2), 
//									   переміщуємо курсор на наступний рядок
//								     */
//	_getch();						 /*	призупиняємо програму, чекаємо, поки користувач натисне
//										на будь-яку клавішу, і продовжуємо виконання програмного коду
//									*/	
//	return 0;						 // завершуємо програму з успішним виконанням
//}










